from telegram.ext import Updater, CommandHandler, MessageHandler, Filters
import apiai, json

updater = Updater(token='729206848:AAGvQeOwvSzWAWyj23xkysX7Jabd7YeE2ok')  # Токен API к Telegram
dispatcher = updater.dispatcher


# Обработка команд
def startCommand(bot, update):
    bot.send_message(chat_id=update.message.chat_id,
                     text='Привіт, це бот для зручного перегляду\n'
                          ' розкладу ліцейних класів\n'
                          '(8 філ; 8 пм; 1 філ; 1 пр;\n'
                          ' 1 мат; 2 філ; 2 мат; 3 філ; 3пм)\n'
                          'на пн, вт, ср, чт, пт\n'
                          'Щоб скористатися моєю допомогою, введи запит /help \n')


def helpCommand(bot, update):
    bot.send_message(chat_id=update.message.chat_id,
                     text ='В наявності є класи :\n'
                           '8 філ; 8 пм; 1 філ; 1 пр;\n'
                           '1 мат; 2 філ; 2 мат;\n'
                           ' 3 філ; 3пм \n'
                           ' і потрібно ввести день наприклад :\n'
                           ' пн - понеділок ,\n'
                           ' вт - вівторок ,\n'
                           ' ср - середа ,\n'
                           ' чт - четверг,\n'
                           ' пт - п`ятниця)\n'
                           'У вас має вийти щось типу (3 філ пн)\n'
                           'Розклад одразу на весь тиждень :\n'
                           '/Rozklad_na_tyzden')
def Rozklad_na_tyzdenCommand(bot,update) :
    bot.send_message(chat_id=update.message.chat_id,
                     text='Вибери свій клас\n'
                          '/eight_NM\n'
                          '/eight_Philological\n'
                          '/first_Mathematical\n'
                          '/first_Philological\n'
                          '/first_Naturalistic\n'
                          '/second_Mathematical\n'
                          '/second_Philological\n'
                          '/third_NM\n'
                          '/third_Philological')
def first_PhilologicalCommand(bot,update) :
    bot.send_message(chat_id=update.message.chat_id,
                    text=" Понеділок\n"
                         " 1 – Географія. 10   каб;\n"
                         " 2 - Географія 10 каб;\n"
                         " 3 – Осн.здор. 17 каб ;\n"                                                                            
                         " 4 – Анг.мова 35 каб ;\n"
                         " 5 - Укр.літ 43 каб ;\n"                                                                           
                         " 6 – Укр.літ 43 каб;\n"
                         " 7 - Фізика 5  каб; \n"
                         " Вівторок\n"                                                                                                                                                        
                         " 1 – Укр.мова. 49   каб;\n"                                                                            
                         " 2 - Укр.мова 49 каб;\n"                                                                            
                         " 3 – Труд.навч. 45 каб ;\n"                                                                            
                         " 4 – Математика 45 каб ;\n"                                                                          
                         " 5 - Математика 54 каб ;\n"                                                                            
                         " 6 – Мистецтво 54 каб;\n"                                                                            
                         " 7 - Фіз.культура Спорт. зал;\n"                                                                            
                         " 8 - Фіз.культура Спорт. зал\n"                                                                           
                         " Середа\n"                                                                            
                         " 1 – Правознавство 45   каб;\n"                                                                            
                         " 2 - Інформатика 51/52 каб;\n"                                                                            
                         " 3 – Інформатика 51/52 каб ;\n"                                                                            
                         " 4 – Анг.мова 35 каб ;\n"                                                                            
                         " 5 - Фіз.культура/Фітнес;\n"                                                                            
                         " 6 – Зар.літ 44 каб;\n"                                                                            
                         " 7 - Укр.літ 48  каб; \n"                                                                            
                         " Четверг\n"                                                                            
                         " 1 – Історія 45   каб;\n"                                                                            
                         " 2 - Історія 45 каб;\n"                                                                            
                         " 3 – Укр.мова 49 каб ;\n"                                                                            
                         " 4 – Укр.мова 49 каб ;\n"                                                                            
                         " 5 - Математика 11 каб ;\n"                                                                            
                         " 6 – Математика 11 каб;\n"                                                                            
                         " 7 - Біологія 50  каб; \n"                                                                            
                         "П'ятниця\n"                                                                             
                         " 1 – Фізика 5 каб;\n"                                                                            
                         " 2 - Фізика 5 каб;\n"                                                                            
                         " 3 – Хімія 10 каб;\n"                                                                            
                         " 4 – Хімія 10 каб ;\n"                                                                            
                         " 5 - Анг.мова 35 каб ;\n"                                                                            
                         " 6 – Зар.літ 44 каб;\n"                                                                            
                         " 7 - Біологія 50  каб; \n")
def first_NaturalisticCommand(bot, update) :
    bot.send_message(chat_id=update.message.chat_id,
                     text=" Понеділок\n"
                          " 1 – Осн.здор. 15   каб;\n"                                                                                               
                          " 2 - Правознавстіо 44 каб;\n"                                                                                               
                          " 3 – Фізика 54 каб ;\n"                                                                                               
                          " 4 – Фізика 54 каб ;\n"                                                                                               
                          " 5 - Фіз.культура Спорт.зал ;\n"                                                                                               
                          " 6 – Фіз.культура Спорт.зал каб;\n"                                                                                               
                          " 7 - Біологія 32  каб; \n"                                                                                               
                          " 8 - Труд.навч. 15\n"                                                                                               
                          " Вівторок\n"                                                                                               
                          " 1 – Математика 49   каб;\n"                                                                                               
                          " 2 - Математика 49 каб;\n"                                                                                               
                          " 3 – Анг.мова 45 каб;\n"                                                                                               
                          " 4 – Анг.мова 45 каб;\n"                                                                                               
                          " 5 - Біологія 32 каб;\n"                                                                                               
                          " 6 – Географія 10 каб;\n"                                                                                              
                          " 7 - Географія 10  каб; \n"                                                                                               
                          " Середа\n"                                                                                               
                                                                                                                         " 1 – Укр.мова. 49   каб;\n"
                                                                                                                         " 2 - Укр.мова 49 каб;\n"
                                                                                                                         " 3 – Фізика 45 каб ;\n"
                                                                                                                         " 4 – Фіз.культура Спорт.зал ;\n"
                                                                                                                         " 5 - Хімія 31 каб ;\n"
                                                                                                                         " 6 – Хімія 31 каб;\n"
                                                                                                                         " 7 - Історія 15  каб; \n"
                                                                                                                         " 8 - Мистецтво 57 каб \n"
                                                                                                                         "Четверг\n"
                                                                                                                         " 1 – Хімія 31 каб;\n"
                                                                                                                         " 2 - Хімія 31 каб;\n"
                                                                                                                         " 3 – Укр.літ 43 каб ;\n"
                                                                                                                         " 4 – Укр.літ 43 каб ;\n"
                                                                                                                         " 5 - Історія 4 каб ;\n"
                                                                                                                         " 6 – Біологія 32 каб;\n"
                                                                                                                         " 7 - Біологія 32  каб; \n"
                                                                                                                         "П'ятниця\n"
                                                                                                                         " 1 – Зар.літ 49   каб;\n"
                                                                                                                         " 2 - Зар.літ 49 каб;\n"
                                                                                                                         " 3 – Інформатика 51/52 каб ;\n"
                                                                                                                         " 4 – Інформатика 51/52 каб ;\n"
                                                                                                                         " 5 - Математика 54 каб ;\n"
                                                                                                                         " 6 – Математика 54 каб;\n")
def first_MathematicalCommand(bot, update) :
    bot.send_message(chat_id=update.message.chat_id,
                     text=" Понеділок\n"
                                                                                                                                             " 1 – Хімія 31   каб;\n"
                                                                                                                                             " 2 - Хімія 31 каб;\n"
                                                                                                                                             " 3 – Географія 10 каб ;\n"
                                                                                                                                             " 4 – Географія 10 каб ;\n"
                                                                                                                                             " 5 - Зар.літ 44 каб ;\n"
                                                                                                                                             " 6 – Труд.навч 17 каб;\n"
                                                                                                                                             " 7 - Зар.літ 44 каб\n"
                                                                                                                                             " Вівторок\n"
                                                                                                                                             " 1 – Біологія 49   каб;\n"
                                                                                                                                             " 2 - Біологія 49 каб;\n"
                                                                                                                                             " 3 – Математика.літ 45 каб ;\n"
                                                                                                                                             " 4 – Математика 45 каб ;\n"
                                                                                                                                             " 5 - Фіз.культура 54 каб ;\n"
                                                                                                                                             " 6 – Фіз.культура 54 каб;\n"
                                                                                                                                             " 7 - Фізика 32  каб; \n"
                                                                                                                                             " Середа\n"
                                                                                                                                             " 1 – Математика 5   каб;\n"
                                                                                                                                             " 2 - Математика 5 каб;\n"
                                                                                                                                             " 3 – Укр.літ 44 каб ;\n"
                                                                                                                                             " 4 – Укр.літ 44 каб ;\n"
                                                                                                                                             " 5 - Осн.здор. 15 каб ;\n"
                                                                                                                                             " 6 – Фіз.культура Спорт.зал;\n"
                                                                                                                                             " 7 - Фіз.культура Спорт.зал\n"
                                                                                                                                             " 8 - Мистецтво 57 каб\n"
                                                                                                                                             " Четверг\n"
                                                                                                                                             " 1 – Математика 49   каб;\n"
                                                                                                                                             " 2 - Математика 49 каб;\n"
                                                                                                                                             " 3 – Історія 45 каб ;\n"
                                                                                                                                             " 4 – Історія 45 каб ;\n"
                                                                                                                                             " 5 - Анг.мова 54 каб ;\n"
                                                                                                                                             " 6 – Анг.мова 54 каб;\n"
                                                                                                                                             " 7 - Інформатика 51/52 каб \n"
                                                                                                                                             " 8 - Інформатика 51/52 каб\n"
                                                                                                                                             " П'ятниця\n"
                                                                                                                                             " 1 – Укр.мова 49   каб;\n"
                                                                                                                                             " 2 - Укр.мова 49 каб;\n"
                                                                                                                                             " 3 – Фізика 45 каб ;\n"
                                                                                                                                             " 4 – Фізика 45 каб ;\n"
                                                                                                                                             " 5 - Математика 54 каб ;\n"
                                                                                                                                             " 6 – Математика 54 каб;\n"
                                                                                                                                             " 7 - Правознавство 45 каб")
def eight_NMCommand(bot,update) :
    bot.send_message(chat_id=update.message.chat_id,
                     text=                                                                                                                                       " Понеділок\n"
                                                                                                                                                                 " 1 - Укр.мова 49 каб;\n"
                                                                                                                                                                 " 2 - Укр.мова 49 каб;\n"
                                                                                                                                                                 " 3 - Математика 45 каб ;\n"
                                                                                                                                                                 " 4 - Математика 45 каб ;\n"
                                                                                                                                                                 " 5 - Історія  54 каб ;\n"
                                                                                                                                                                 " 6 - Анг.мова 54 каб;\n"
                                                                                                                                                                 " Вівторок\n"
                                                                                                                                                                 " 1 - Біологія/Матем. 49 каб;\n"
                                                                                                                                                                 " 2 - Біологія/Матем. 49 каб;\n"
                                                                                                                                                                 " 3 - Осн.здор 45 каб ;\n"
                                                                                                                                                                 " 4 - Фіз.культура 45 каб ;\n"
                                                                                                                                                                 " 5 - Математика 54 каб ;\n"
                                                                                                                                                                 " 6 - Математика 54 каб;\n"
                                                                                                                                                                 " 7 - Правознавство 45 каб\n"
                                                                                                                                                                 " Середа\n"
                                                                                                                                                                 " 1 - Анг.мова 4 каб;\n"
                                                                                                                                                                 " 2 - Анг.мова 4 каб;\n"
                                                                                                                                                                 " 3 - Біологія 32/50 каб ;\n"
                                                                                                                                                                 " 4 - Біологія 32/50 каб ;\n"
                                                                                                                                                                 " 5 - Мистецтво 57 каб ;\n"
                                                                                                                                                                 " 6 - Історія 45 каб;\n"
                                                                                                                                                                 " 7 - Інформатика 51/52 каб\n"
                                                                                                                                                                 " 8 - Інформатика 51/52 каб\n"
                                                                                                                                                                 " Четверг\n"
                                                                                                                                                                 " 1 - Матем./Хімія 15/31 каб;\n"
                                                                                                                                                                 " 2 - Матем./Хімія 15/32 каб;\n"
                                                                                                                                                                 " 3 - Хімія/Матем. 31/5  каб ;\n"
                                                                                                                                                                 " 4 - Хімія/Матем. 31/5  каб ;\n"
                                                                                                                                                                 " 5 - Фіз.культура Спорт.зал ;\n"
                                                                                                                                                                 " 6 - Фіз.культура Спорт.зал ;\n"
                                                                                                                                                                 " 7 - Зар.літ 44 каб\n"
                                                                                                                                                                 " П'ятниця\n"
                                                                                                                                                                 " 1 - Географія 10 каб;\n"
                                                                                                                                                                 " 2 - Географія 10 каб;\n"
                                                                                                                                                                 " 3 - Хімія/Матем. 31/5 каб;\n"
                                                                                                                                                                 " 4 - Хімія/Матем. 31/5 каб;\n"
                                                                                                                                                                 " 5 - Укр.літ 43 каб;\n"
                                                                                                                                                                 " 6 - Укр.літ 43 каб;\n"
                                                                                                                                                                 " 7 - Труд.навч 15 каб;\n")
def eight_PhilologicalCommand(bot,update):
    bot.send_message(chat_id=update.message.chat_id,
                     text=                " Понеділок\n"
                                          " 1 - Анг.мова 34/50   каб;\n"                                                                                                                                               
                                          " 2 - Анг.мова 34/50 каб;\n"                                                                                                                                               
                                          " 3 - Укр.мова 43/34 каб ;\n"                                                                                                                                               
                                          " 4 - Укр.мова 43/34 каб ;\n"                                                                                                                                              
                                          " 5 - Хімія 5 каб ;\n"                                                                                                                                               
                                          " 6 - Хімія 5 каб;\n"                                                                                                                                               
                                          " 7 - Історія 50 каб\n"                                                                                                                                              
                                          " Вівторок\n"                                                                                                                                               
                                          " 1 - Математика 10   каб;\n"                                                                                                                                               
                                          " 2 - Математика 10 каб;\n"                                                                                                                                               
                                          " 3 - Інформатика 51/52 каб ;\n"                                                                                                                                              
                                          " 4 - Інформатика 51/52 каб ;\n"                                                                                                                                               
                                          " 5 - Труд.навч 43 каб ;\n"                                                                                                                                               
                                          " 6 - Укр.літ 43 каб;\n"                                                                                                                                               
                                          " 7 - Укр.літ 15 каб\n"                                                                                                                                               
                                          " 8 - Мистецтво 57 каб\n"                                                                                                                                               
                                          " Середа\n"                                                                                                                                               
                                          " 1 - Фізика 54   каб;\n"                                                                                                                                               
                                          " 2 - Фізика 54 каб;\n"                                                                                                                                               
                                          " 3 - Укр.мова 4/43 каб ;\n"                                                                                                                                               
                                          " 4 - Укр.мова 4/43 каб ;\n"                                                                                                                                               
                                          " 5 - Фіз.культура 43 каб ;\n"                                                                                                                                               
                                          " 6 - Фіз.культура 43 каб;\n"                                                                                                                                               
                                          " 7 - Зар.літ 44 каб\n"                                                                                                                                               
                                          " Четверг\n"                                                                                                                                               
                                          " 1 - Географія 10   каб;\n"                                                                                                                                               
                                          " 2 - Географія 10 каб;\n"                                                                                                                                               
                                          " 3 - Анг.мова 34/15 каб ;\n"                                                                                                                                               
                                          " 4 - Анг.мова 34/15 каб ;\n"                                                                                                                                               
                                          " 5 - Укр.літ 43 каб ;\n"                                                                                                                                               
                                          " 6 - Укр.літ 43 каб;\n"                                                                                                                                               
                                          " 7 - Осн.здор 57 каб\n"                                                                                                                                               
                                          " П'ятниця\n"                                                                                                                                               
                                          " 1 - Математика 12 каб;\n"                                                                                                                                               
                                          " 2 - Математика 12 каб;\n"                                                                                                                                               
                                          " 3 - Історія 35 каб ;\n"                                                                                                                                               
                                          " 4 - Біологія 50 каб ;\n"                                                                                                                                               
                                          " 5 - Біологія 50 каб ;\n"                                                                                                                                               
                                          " 6 - Фіз.культура Спорт.зал;\n"                                                                                                                                               
                                          " 7 - Зар.літ 44 каб\n")























def second_MathematicalCommand(bot, update):
    bot.send_message(chat_id=update.message.chat_id,
                     text="Понеділок :\n"
                     "1 - Фізика 54 каб ;\n" 
                     "2 - Фізика 54 каб ;\n"        
                     "3 - Хімія 11 каб;\n"        
                     "4 - Алгебра 32 каб;\n"         
                     "5 - Алгебра 31 каб;\n"                                      
                     "6 - Зар літ-ра 44 каб ;\n"                                        
                     "7 -  Укр літ 48 каб ;\n"                                        
                     "8 - Зах. Віт. 4 каб.\n"
                     "Вівторок\n"
                     "1 - Алгебра 45 каб ;\n"
                     "2 - Алгебра 45 каб ;\n"     
                     "3 - Біологія 32 каб;\n"    
                     "4 - Біологія 32 каб ;\n"    
                     "5 - Укр. літ. 48 каб ;\n"
                     "6 - Фітнес навпроти 43 каб\n"
                     "Середа\n"
                     "1 - Геометрія  32 каб ;\n"
                     "2 - Географія  10 каб ;\n"
                     "3 - Англ. мова. 42 каб;\n"
                     "4 - Англ. мова. 42 каб ;\n"
                     "5 - Риторика. 48 каб ;\n"
                     "6 - Географія 10 каб ;\n"
                     "7 - Фіз-ра Спорт зал ;\n"
                     "8 - Фіз-ра Спорт зал.\n "
                     "Четверг\n"
                     "1 - Фізика  48 каб ;\n"
                     "2 - Інформатика 51/52 каб ;\n"
                     "3 - Алгебра 50 каб;\n"
                     "4 - Алгебра 44 каб ;\n"
                     "5 - Історія України   45 каб ;\n"
                     "6 - Всесвітня Історія 45 каб ;\n"
                     "7 -  Хімія -31каб ;\n"
                     "8 - Трудове навчання 15каб\n "
                     "П'ятниця\n"
                     "1 - Геометрія   41 каб ;\n"
                     "2 - Геометрія  49 каб ;\n"
                     "3 - Укр. мова. 48 каб;\n"
                     "4 - Укр. мова. 48 каб ;\n"
                     "5 - Громадянска освіта 45 каб ;\n"
                     "6 - Інформатика 51/52 каб ;\n"
                     "7 - Громадянська освіта 45 каб ")
def second_PhilologicalCommand(bot, update) :
    bot.send_message(chat_id=update.message.chat_id,
                     text="Понеділок :\n"
                          " 1 - Громадянська освіта 45 каб;\n"
                          " 2 - Інформатика 51/52 каб ;\n"
                          " 3 - Історія  45каб ;\n"
                          " 4 - Укр.літ. 49 каб ;\n"
                          " 5 - Укр.літ. 49  каб ;\n"
                          " 6 - Фіз-ра  спортивний зал;\n"
                          " 7 - Фіз-ра  спортивний зал\n"
                          "Вівторок\n"
                          " 1 -  Фізика 54 каб;\n"
                          " 2 - Фізика 54 каб ;\n"
                          " 3 - Всесвітня історія 45 каб ;\n"
                          " 4 - Труд.навчання 15 каб ;\n"
                          " 5 - Риторика     10 каб  ;\n"
                          " 6 - Інформатика  51/52 каб ;\n"
                          " 7 - Фіз-ра  спортивний зал\n"
                          'Середа\n'
                          " 1 - Математика 12 каб;\n"
                          " 2 - Математика 12 каб ;\n"
                          " 3 - Українська мова  49 каб ;\n"
                          " 4 - Українська мова  49  каб ;\n"
                          " 5 - Географія 10 каб  ;\n"
                          " 6 - Етика-    10 каб ;\n"
                          " 7 - Хімія     31 каб;\n"
                          " 8 - Захист Вітчизни 4/11 каб\n"
                          'Четверг\n'
                          " 1 - Математика 12 каб;\n"
                          " 2 - Англійська мова 42 каб ;\n"
                          " 3 - Англійська мова 42 каб;\n"
                          " 4 - Біологія  32  каб ;\n"
                          " 5 - Біологія 32  каб  ;\n"
                          " 6 - Укр.літ. 49 каб ;\n"
                          " 7 - Укр.літ. 49  каб\n"
                          'П`ятниця\n'
                          " 1 - Хімія 31   каб;\n"
                          " 2 - Громадянська освіта 45 каб;\n"
                          " 3 - Українська мова 49 каб ;\n"
                          " 4 - Українська мова 49 каб ;\n"
                          " 5 - Англійська мова 42 каб ;\n"
                          " 3 - Англійська мова 42 каб;\n"
                          " 7 - Фізика 54  каб; ")

def third_NMCommand(bot,update) :
        bot.send_message(chat_id=update.message.chat_id,
                     text="Понеділок :\n"
                          " 1 - Біологія/Матем. 32/5   каб;\n"
                          " 2 - Біологія/Матем. 32/5 каб;\n"
                          " 3 - Матем./Хімія 12/32 каб ;\n"
                          " 4 - Матем/Біологія 12/50 каб ;\n"
                          " 5 - Труд. навч. 17 каб ;\n"
                          " 6 - Хімія/Інформ. 31/52 каб;\n"
                          " 7 - Інформ. 51/52  каб;\n "
                          "Вівторок\n"
                          " 1 - Укр. мова 48   каб;\n"
                          " 2 - Укр. мова 48 каб;\n"
                          " 3 - Хімія/Фізика 31/54 каб ;\n"
                          " 4 - Хімія/Фізика 31/54 каб ;\n"
                          " 5 - Історія 45 каб ;\n"
                          " 6 - Зар. літ. 44 каб;\n"
                          " 7 - Екологія 50  каб; \n"
                          "Середа\n"
                          " 1 - Хімія/Матем. 31   каб;\n"
                          " 2 - Хімія/Матем. 45 каб;\n"
                          " 3 - Укр. літ. 49 каб ;\n"
                          " 4 - Укр. літ. 49 каб ;\n"
                          " 5 - Біологія/Матем. 42 каб ;\n"
                          " 6 - Англійська мова 42 каб;\n"
                          " 7 - Хімія 54  каб; \n "
                          "Четверг\n"
                          " 1 - Фізика/Матем. 54/11   каб;\n"
                          " 2 - Фізика/Матем. 54/11 каб;\n"
                          " 3 - Анг.мова 35 каб ;\n"
                          " 4 - Анг.мова 35 каб ;\n"
                          " 5 - Матем./Фізика 12/54 каб ;\n"
                          " 6 - Зах.Вітчизни 57/4 каб;\n"
                          " 7 - Фіз.Культура Спорт. зал ;\n"
                          " 8 - Фіз.Культура Спорт. зал\n"
                          "П'ятниця\n"
                          " 1 - Біологія/Матем. 32/54 каб;\n"
                          " 2 - Біологія/Матем. 32/54 каб;\n"
                          " 3 - Історія 45 каб ;\n"
                          " 4 - Історія 45 каб ;\n"
                          " 5 - Астрономія 52 каб ;\n"
                          " 6 - Економіка 10 каб;")
def third_PhilologicalCommand(bot,update):
        bot.send_message(chat_id=update.message.chat_id,
                     text="Понеділок :\n"
                          " 1 - Математика 11 каб;\n"
                          " 2 - Математика 11 каб;\n"
                          " 3 - Укр.мова 49 каб ;\n"
                          " 4 - Укр.мова. 49 каб ;\n"
                          " 5 - Зах.Вітчизни 12/49 каб ;\n"
                          " 6 - Історія 45 каб;\n"
                          " 7 - Історія 45  каб; \n"
                          "Вівторок\n"
                          " 1 - Астрономія 11   каб;\n"
                          " 2 - Інформатика 51/52 каб;\n"
                          " 3 - Анг.мова 35 каб ;\n"
                          " 4 - Анг.мова 35 каб ;\n"
                          " 5 - Укр.літ 49 каб ;\n"
                          " 6 - Укр.літ 49 каб;\n"
                          " 7 - Зар.літ 49  каб;\n"
                          "Середа\n"
                          " 1 - Укр.мова. 49   каб;\n"
                          " 2 - Укр.мова 49 каб;\n"
                          " 3 - Історія 45 каб ;\n"
                          " 4 - Історія 45 каб ;\n"
                          " 5 - Фізика 54 каб ;\n"
                          " 6 - Фізика 54 каб;\n"
                          " 7 - Технології 15  каб; \n"
                          "Четверг\n"
                          " 1 - Зар.літ 50   каб;\n"
                          " 2 - Зар.літ 50 каб;\n"
                          " 3 - Економіка 10 каб ;\n"
                          " 4 - Екологія 50 каб ;\n"
                          " 5 - Біологія 50 каб ;\n"
                          " 6 - Хімія 54 каб;\n "
                          "П'ятниця\n"
                          " 1 - Анг.мова 31   каб;\n"
                          " 2 - Анг.мова 45 каб;\n"
                          " 3 - Математика 49 каб ;\n"
                          " 4 - Математика 49 каб ;\n"
                          " 5 - Укр.літ. 42 каб ;\n"
                          " 6 - Укр.літ 42 каб;\n"
                          " 7 - Фіз.культура;\n"
                          " 8 - Фіз.культура ")
def textMessage(bot, update):
    k = str(update.message.text)
    if k == '2 мат пн' :
        bot.send_message(chat_id=update.message.chat_id,
                         text="Понеділок\n"
                              " 1 - Фізика 54 каб ;\n" 
                              " 2 - Фізика 54 каб ;\n"
                              " 3 - Хімія 11 каб;\n"
                              " 4 - Алгебра 32 каб;\n"
                              " 5 - Алгебра 31 каб;\n"                             
                              " 6 - Зар літ-ра 44 каб;\n"                               
                              " 7 -  Укр літ 48 каб ;\n"                               
                              " 8 - Зах. Віт. 4 каб.")

    else:
        if k == '2 мат вт' :
            bot.send_message(chat_id=update.message.chat_id,
                             text="Вівторок\n"
                                  "1 - Алгебра  45 каб ;\n"
                                  " 2 - Алгебра 45 каб ;\n"
                                  " 3 - Біологія 32 каб;\n"
                                  " 4 - Біологія 32 каб ;\n"
                                  " 5 - Укр. літ. 48 каб ;\n"
                                  " 6 - Фітнес навпроти 43 каб")
        else:
            if k == '2 мат ср' :
                bot.send_message(chat_id=update.message.chat_id,
                                 text="Середа\n"
                                      "1 - Геометрія  32 каб ;\n"
                                      "2 - Географія  10 каб ;\n"
                                      "3 - Англ. мова. 42 каб;\n"
                                      "4 - Англ. мова. 42 каб;\n"
                                      "5 - Риторика. 48 каб;\n"
                                      "6 - Географія 10 каб;\n"
                                      "7 - Фіз-ра Спорт зал;\n"
                                      "8 - Фіз-ра Спорт зал; ")
            else:
                if k == '2 мат чт' :
                    bot.send_message(chat_id=update.message.chat_id,
                                     text="Четверг\n"
                                          "1 - Фізика  48 каб ;\n"
                                          "2 - Інформатика 51 каб ;\n"
                                          "3 - Алгебра 50 каб;\n"
                                          "4 - Алгебра 44 каб ;\n"
                                          "5 - Історія України 45 каб ;\n"
                                          "6 - Всесвітня Історія 45 каб ;\n"
                                          "7 -  Хімія -31каб ;\n"
                                          "8 - Трудове навчання 15каб ")

                else :
                    if k == '2 мат пт' :
                        bot.send_message(chat_id=update.message.chat_id,
                                         text="П'ятниця\n"
                                              "1 - Геометрія  41 каб ;\n"
                                              " 2 - Геометрія 49 каб ;\n"
                                              " 3 - Укр. мова. 48 каб;\n"
                                              " 4 - Укр. мова. 48 каб ;\n"
                                              " 5 - Громадянска освіта 45 каб ;\n"
                                              " 6 - Інформатика 51 каб ;\n"
                                              " 7 - Громадянська освіта 45 каб ")
                    else:
                        if k == '2 філ пн' :
                            bot.send_message(chat_id=update.message.chat_id,
                                             text=" Понеділок\n"
                                                  " 1 – Громадянська освіта 45 каб;\n"
                                                  " 2 – Інформатика 51/53 каб ;\n"
                                                  " 3 - Історія  45каб ;\n"
                                                  " 4 – Укр.літ. 49 каб ;\n"
                                                  " 5 – Укр.літ. 49  каб ;\n"
                                                  " 6 – Фіз-ра  спортивний зал ;\n"
                                                  " 7 – Фіз-ра  спортивний зал")
                        else :
                            if k == '2 філ вт' :
                                bot.send_message(chat_id=update.message.chat_id,
                                                 text=" Вівторок"
                                                      " 1 –  Фізика 54 каб;\n"
                                                      " 2 – Фізика 54 каб ;\n"
                                                      " 3 – Всесвітня історія 45 каб ;\n"
                                                      " 4 –Труд.навчання 15 каб ;\n"
                                                      " 5 – Риторика 10 каб  ;\n"
                                                      " 6 – Інформатика 51 каб ;\n"
                                                      " 7 – Фіз-ра  спортивний зал")
                            else :
                                if k == '2 філ ср' :
                                    bot.send_message(chat_id=update.message.chat_id,
                                                     text=" Середа\n"
                                                          " 1 –  Математика 12 каб;\n"
                                                          " 2 – Математика 12 каб ;\n"
                                                          " 3 – Українська мова  49 каб ;\n"
                                                          " 4 – Українська мова  49  каб ;\n"
                                                          " 5 – Географія 10 каб  ;\n"
                                                          " 6 - Етика 10 каб ;\n"
                                                          " 7 - Хімія 31 каб;\n"
                                                          " 8 – Захист Вітчизни 4/11 каб")
                                else :
                                    if k == '2 філ чт' :
                                        bot.send_message(chat_id=update.message.chat_id,
                                                         text=" Четверг\n"
                                                              " 1 – Математика 12 каб;\n"
                                                              " 2 – Англійська мова 42 каб ;\n"
                                                              " 3 – Англійська мова 42 каб;\n"
                                                              " 4 – Біологія  32  каб ;\n"
                                                              " 5 – Біологія 32  каб  ;\n"
                                                              " 6 – Укр.літ. 49 каб ;\n"
                                                              " 7 – Укр.літ. 49  каб")
                                    else :
                                        if k == '2 філ пт' :
                                                bot.send_message(chat_id=update.message.chat_id,
                                                                 text=" П'ятниця\n"
                                                                      " 1 – Хімія 31   каб;\n"
                                                                      " 2 - Громадянська освіта 45 каб;\n"
                                                                      " 3 – Українська мова 49 каб ;\n"
                                                                      " 4 – Українська мова 49 каб ;\n"
                                                                      " 5 - Англійська мова 42 каб ;\n"
                                                                      " 3 – Англійська мова 42 каб;\n"
                                                                      " 7 - Фізика 54  каб; ")
                                        else :
                                            if k == '3 пм пн' :
                                                bot.send_message(chat_id=update.message.chat_id,
                                                                 text=" 1 –Хімія 31   каб;\n"
                                                                      "Понеділок \n"
                                                                      " 1 – Біологія/Матем. 32/5   каб;\n"
                                                                      " 2 - Біологія/Матем. 32/5 каб;\n"
                                                                      " 3 – Матем./Хімія 12/32 каб ;\n"
                                                                      " 4 – Матем/Біологія 12/50 каб ;\n"
                                                                      " 5 - Труд. навч. 17 каб ;\n"
                                                                      " 6 – Хімія/Інформ. 31/52 каб;\n"
                                                                      " 7 - Інформ. 51/52  каб;\n ")
                                            else:
                                                if k == '3 пм вт' :
                                                    bot.send_message(chat_id=update.message.chat_id,
                                                                     text="Вівторок\n"
                                                                          " 1 – Укр. мова 48   каб;\n"
                                                                          " 2 - Укр. мова 48 каб;\n"
                                                                          " 3 – Хімія/Фізика 31/54 каб ;\n"
                                                                          " 4 – Хімія/Фізика 31/54 каб ;\n"
                                                                          " 5 - Історія 45 каб ;\n"
                                                                          " 6 – Зар. літ. 44 каб;\n"
                                                                          " 7 - Екологія 50  каб; \n")
                                                else :
                                                    if k ==  '3 пм ср' :
                                                        bot.send_message(chat_id=update.message.chat_id,
                                                                         text="Середа\n"
                                                                              " 1 - Хімія/Матем. 31   каб;\n"
                                                                              " 2 - Хімія/Матем. 45 каб;\n"
                                                                              " 3 - Укр. літ. 49 каб;\n"
                                                                              " 4 - Укр. літ. 49 каб;\n"
                                                                              " 5 - Біологія/Матем. 42 каб ;\n"
                                                                              " 6 - Англійська мова 42 каб;\n"
                                                                              " 7 - Хімія 54  каб; ")
                                                    else:
                                                        if k == '3 пм чт' :
                                                            bot.send_message(chat_id=update.message.chat_id,
                                                                             text="Четверг\n"
                                                                                  " 1 - Фізика/Матем. 54/11 каб;\n"
                                                                                  " 2 - Фізика/Матем. 54/11 каб;\n"
                                                                                  " 3 - Анг.мова 35 каб ;\n"
                                                                                  " 4 - Анг.мова 35 каб ;\n"
                                                                                  " 5 - Матем./Фізика 12/54 каб ;\n"
                                                                                  " 6 - Зах.Вітчизни 57/4 каб;\n"
                                                                                  " 7 - Фіз.Культура Спорт. зал ;\n"
                                                                                  " 8 - Фіз.Культура Спорт. зал")
                                                        else:
                                                            if k == '3 пм пт' :
                                                                bot.send_message(chat_id=update.message.chat_id,
                                                                                 text="П'ятниця\n"
                                                                                      " 1 - Біологія/Матем. 32/54 каб;\n"
                                                                                      " 2 - Біологія/Матем. 32/54 каб;\n"
                                                                                      " 3 - Історія 45 каб ;\n"
                                                                                      " 4 - Історія 45 каб ;\n"
                                                                                      " 5 - Астрономія 52 каб ;\n"
                                                                                      " 6 - Економіка 10 каб;")
                                                            else:
                                                                if k == '3 філ пн':
                                                                    bot.send_message(chat_id=update.message.chat_id,
                                                                                     text="Понеділок \n"
                                                                                          " 1 - Математика 11   каб;\n"
                                                                                          " 2 - Математика 11 каб;\n"
                                                                                          " 3 - Укр.мова 49 каб ;\n"
                                                                                          " 4 - Укр.мова. 49 каб ;\n"
                                                                                          " 5 - Зах.Вітчизни 12/49 каб ;\n"
                                                                                          " 6 - Історія 45 каб;\n"
                                                                                          " 7 - Історія 45  каб; \n")

                                                                else:
                                                                    if k == '3 філ вт':
                                                                        bot.send_message(chat_id=update.message.chat_id,
                                                                                         text="Вівторок\n"
                                                                                              " 1 - Астрономія 11   каб;\n"
                                                                                              " 2 - Інформатика 51/53 каб;\n"
                                                                                              " 3 - Анг.мова 35 каб ;\n"
                                                                                              " 4 - Анг.мова 35 каб ;\n"
                                                                                              " 5 - Укр.літ 49 каб ;\n"
                                                                                              " 6 - Укр.літ 49 каб;\n"
                                                                                              " 7 - Зар.літ 49  каб;")
                                                                    else:
                                                                        if k == '3 філ ср':
                                                                            bot.send_message(
                                                                                chat_id=update.message.chat_id,
                                                                                text=" Середа\n"
                                                                                     " 1 - Укр.мова. 49   каб;\n"
                                                                                     " 2 - Укр.мова 49 каб;\n"
                                                                                     " 3 - Історія 45 каб ;\n"
                                                                                     " 4 - Історія 45 каб ;\n"
                                                                                     " 5 - Фізика 54 каб ;\n"
                                                                                     " 6 - Фізика 54 каб;\n"
                                                                                     " 7 - Технології 15  каб; \n")

                                                                        else:
                                                                            if k == '3 філ чт':
                                                                                bot.send_message(
                                                                                    chat_id=update.message.chat_id,
                                                                                    text=" Четверг\n"
                                                                                         " 1 - Зар.літ 50   каб;\n"
                                                                                         " 2 - Зар.літ 50 каб;\n"
                                                                                         " 3 - Економіка 10 каб ;\n"
                                                                                         " 4 - Екологія 50 каб ;\n"
                                                                                         " 5 - Біологія 50 каб ;\n"
                                                                                         " 6 - Хімія 54 каб;\n ")

                                                                            else:
                                                                                if k == '3 філ пт':
                                                                                    bot.send_message(
                                                                                        chat_id=update.message.chat_id,
                                                                                        text="П'ятниця\n"
                                                                                             " 1 - Анг.мова 31   каб;\n"
                                                                                             " 2 - Анг.мова 45 каб;\n"
                                                                                             " 3 - Математика 49 каб ;\n"
                                                                                             " 4 - Математика 49 каб ;\n"
                                                                                             " 5 - Укр.літ. 42 каб ;\n"
                                                                                             " 6 - Укр.літ 42 каб;\n"
                                                                                             " 7 - Фіз.культура;\n"
                                                                                             " 8 - Фіз.культура ")
                                                                                else:
                                                                                    if k == '1 філ пн':
                                                                                        bot.send_message(
                                                                                            chat_id=update.message.chat_id,
                                                                                            text="Понеділок\n"
                                                                                                 " 1 - Географія. 10   каб;\n"
                                                                                                 " 2 - Географія 10 каб;\n"
                                                                                                 " 3 - Осн.здор. 17 каб ;\n"
                                                                                                 " 4 - Анг.мова 35 каб ;\n"
                                                                                                 " 5 - Укр.літ 43 каб ;\n"
                                                                                                 " 6 - Укр.літ 43 каб;\n"
                                                                                                 " 7 - Фізика 5  каб; \n")
                                                                                    else:
                                                                                        if k == '1 філ вт':
                                                                                            bot.send_message(
                                                                                                chat_id=update.message.chat_id,
                                                                                                text="Вівторок\n"
                                                                                                     " 1 - Укр.мова. 49   каб;\n"
                                                                                                     " 2 - Укр.мова 49 каб;\n"
                                                                                                     " 3 - Труд.навч. 45 каб ;\n"
                                                                                                     " 4 - Математика 45 каб ;\n"
                                                                                                     " 5 - Математика 54 каб ;\n"
                                                                                                     " 6 - Мистецтво 54 каб;\n"
                                                                                                     " 7 - Фіз.культура Спорт. зал;\n"
                                                                                                     " 8 - Фіз.культура Спорт. зал")
                                                                                        else:
                                                                                            if k == '1 філ ср':
                                                                                                bot.send_message(
                                                                                                    chat_id=update.message.chat_id,
                                                                                                    text="Середа"
                                                                                                         " 1 - Правознавство 45 каб;\n"
                                                                                                         " 2 - Інформатика 51/52 каб;\n"
                                                                                                         " 3 - Інформатика 51/52 каб ;\n"
                                                                                                         " 4 - Анг.мова 35 каб ;\n"
                                                                                                         " 5 - Фіз.культура/Фітнес ;\n"
                                                                                                         " 6 - Зар.літ 44 каб;\n"
                                                                                                         " 7 - Укр.літ 48  каб; \n")
                                                                                            else:
                                                                                                if k == '1 філ чт':
                                                                                                    bot.send_message(
                                                                                                        chat_id=update.message.chat_id,
                                                                                                        text="Четверг"
                                                                                                             " 1 - Історія 45   каб;\n"
                                                                                                             " 2 - Історія 45 каб;\n"
                                                                                                             " 3 - Укр.мова 49 каб ;\n"
                                                                                                             " 4 - Укр.мова 49 каб ;\n"
                                                                                                             " 5 - Математика 11 каб ;\n"
                                                                                                             " 6 - Математика 11 каб;\n"
                                                                                                             " 7 - Біологія 50  каб; \n")
                                                                                                else:
                                                                                                    if k == '1 філ пт':
                                                                                                        bot.send_message(
                                                                                                            chat_id=update.message.chat_id,
                                                                                                            text="П'ятниця"
                                                                                                                 " 1 - Фізика 5   каб;\n"
                                                                                                                 " 2 - Фізика 5 каб;\n"
                                                                                                                 " 3 - Хімія 10 каб ;\n"
                                                                                                                 " 4 - Хімія 10 каб ;\n"
                                                                                                                 " 5 - Анг.мова 35 каб ;\n"
                                                                                                                 " 6 - Зар.літ 44 каб;\n"
                                                                                                                 " 7 - Біологія 50  каб; \n")

                                                                                                    else:
                                                                                                            if k == '1 пр пн':
                                                                                                                bot.send_message(
                                                                                                                    chat_id=update.message.chat_id,
                                                                                                                    text=" Понеділок\n"
                                                                                                                         " 1 - Осн.здор. 15   каб;\n"
                                                                                                                         " 2 - Правознавстіо 44 каб;\n"
                                                                                                                         " 3 - Фізика 54 каб ;\n"
                                                                                                                         " 4 - Фізика 54 каб ;\n"
                                                                                                                         " 5 - Фіз.культура Спорт.зал ;\n"
                                                                                                                         " 6 - Фіз.культура Спорт.зал каб;\n"
                                                                                                                         " 7 - Біологія 32  каб; \n"
                                                                                                                         " 8 - Труд.навч. 15")
                                                                                                            else:
                                                                                                                if k == '1 пр вт':
                                                                                                                    bot.send_message(
                                                                                                                        chat_id=update.message.chat_id,
                                                                                                                        text=" Вівторок\n"
                                                                                                                             " 1 - Математика 49   каб;\n"
                                                                                                                             " 2 - Математика 49 каб;\n"
                                                                                                                             " 3 - Анг.мова 45 каб;\n"
                                                                                                                             " 4 - Анг.мова 45 каб;\n"
                                                                                                                             " 5 - Біологія 32 каб;\n"
                                                                                                                             " 6 - Географія 10 каб;\n"
                                                                                                                             " 7 - Географія 10  каб; \n")
                                                                                                                else:
                                                                                                                    if k == '1 пр ср':
                                                                                                                        bot.send_message(
                                                                                                                            chat_id=update.message.chat_id,
                                                                                                                            text=" Середа\n"
                                                                                                                                 " 1 - Укр.мова. 49   каб;\n"
                                                                                                                                 " 2 - Укр.мова 49 каб;\n"
                                                                                                                                 " 3 - Фізика 45 каб ;\n"
                                                                                                                                 " 4 - Фіз.культура Спорт.зал ;\n"
                                                                                                                                 " 5 - Хімія 31 каб ;\n"
                                                                                                                                 " 6 - Хімія 31 каб;\n"
                                                                                                                                 " 7 - Історія 15  каб; \n"
                                                                                                                                 " 8 - Мистецтво 57 каб \n")
                                                                                                                    else:
                                                                                                                        if k == '1 пр чт':
                                                                                                                            bot.send_message(
                                                                                                                                chat_id=update.message.chat_id,
                                                                                                                                text="Четверг\n"
                                                                                                                                     " 1 - Хімія 31 каб;\n"
                                                                                                                                     " 2 - Хімія 31 каб;\n"
                                                                                                                                     " 3 - Укр.літ 43 каб ;\n"
                                                                                                                                     " 4 - Укр.літ 43 каб ;\n"
                                                                                                                                     " 5 - Історія 4 каб ;\n"
                                                                                                                                     " 6 - Біологія 32 каб;\n"
                                                                                                                                     " 7 - Біологія 32  каб; \n")
                                                                                                                        else:
                                                                                                                            if k == '1 пр пт':
                                                                                                                                bot.send_message(
                                                                                                                                    chat_id=update.message.chat_id,
                                                                                                                                    text="П'ятниця\n"
                                                                                                                                         " 1 - Зар.літ 49   каб;\n"
                                                                                                                                         " 2 - Зар.літ 49 каб;\n"
                                                                                                                                         " 3 - Інформатика 45 каб ;\n"
                                                                                                                                         " 4 - Інформатика 45 каб ;\n"
                                                                                                                                         " 5 - Математика 54 каб ;\n"
                                                                                                                                         " 6 - Математика 54 каб;\n")
                                                                                                                            else:
                                                                                                                                if k == '1 мат пн':
                                                                                                                                    bot.send_message(
                                                                                                                                        chat_id=update.message.chat_id,
                                                                                                                                        text=" Понеділок\n"
                                                                                                                                             " 1 - Хімія 31   каб;\n"
                                                                                                                                             " 2 - Хімія 31 каб;\n"
                                                                                                                                             " 3 - Географія 10 каб ;\n"
                                                                                                                                             " 4 - Географія 10 каб ;\n"
                                                                                                                                             " 5 - Зар.літ 44 каб ;\n"
                                                                                                                                             " 6 - Труд.навч 17 каб;\n"
                                                                                                                                             " 7 - Зар.літ 44 каб")
                                                                                                                                else:
                                                                                                                                    if k == '1 мат вт':
                                                                                                                                        bot.send_message(
                                                                                                                                            chat_id=update.message.chat_id,
                                                                                                                                            text=" Вівторок\n"
                                                                                                                                                 " 1 - Біологія 49   каб;\n"
                                                                                                                                                 " 2 - Біологія 49 каб;\n"
                                                                                                                                                 " 3 - Математика.літ 45 каб ;\n"
                                                                                                                                                 " 4 - Математика 45 каб ;\n"
                                                                                                                                                 " 5 - Фіз.культура 54 каб ;\n"
                                                                                                                                                 " 6 - Фіз.культура 54 каб;\n"
                                                                                                                                                 " 7 - Фізика 32  каб; \n")
                                                                                                                                    else:
                                                                                                                                        if k == '1 мат ср':
                                                                                                                                            bot.send_message(
                                                                                                                                                chat_id=update.message.chat_id,
                                                                                                                                                text=" Середа\n"
                                                                                                                                                     " 1 - Математика 5   каб;\n"
                                                                                                                                                     " 2 - Математика 5 каб;\n"
                                                                                                                                                     " 3 - Укр.літ 44 каб ;\n"
                                                                                                                                                     " 4 - Укр.літ 44 каб ;\n"
                                                                                                                                                     " 5 - Осн.здор. 15 каб ;\n"
                                                                                                                                                     " 6 - Фіз.культура Спорт.зал;\n"
                                                                                                                                                     " 7 - Фіз.культура Спорт.зал"
                                                                                                                                                     " 8 - Мистецтво 57 каб")
                                                                                                                                        else:
                                                                                                                                            if k == '1 мат чт':
                                                                                                                                                bot.send_message(
                                                                                                                                                    chat_id=update.message.chat_id,
                                                                                                                                                    text=" Четверг\n"
                                                                                                                                                         " 1 – Математика 49   каб;\n"
                                                                                                                                                         " 2 - Математика 49 каб;\n"
                                                                                                                                                         " 3 – Історія 45 каб ;\n"
                                                                                                                                                         " 4 – Історія 45 каб ;\n"
                                                                                                                                                         " 5 - Анг.мова 54 каб ;\n"
                                                                                                                                                         " 6 – Анг.мова 54 каб;\n"
                                                                                                                                                         " 7 - Інформатика 51/52 каб \n"
                                                                                                                                                         " 8 - Інформатика 51/52 каб")
                                                                                                                                            else:
                                                                                                                                                if k == '1 мат пт':
                                                                                                                                                    bot.send_message(
                                                                                                                                                        chat_id=update.message.chat_id,
                                                                                                                                                        text=" П'ятниця\n"
                                                                                                                                                             " 1 – Укр.мова 49   каб;\n"
                                                                                                                                                             " 2 - Укр.мова 49 каб;\n"
                                                                                                                                                             " 3 – Фізика 45 каб ;\n"
                                                                                                                                                             " 4 – Фізика 45 каб ;\n"
                                                                                                                                                             " 5 - Математика 54 каб ;\n"
                                                                                                                                                             " 6 – Математика 54 каб;\n"
                                                                                                                                                             " 7 - Правознавство 45 каб")
                                                                                                                                                else:
                                                                                                                                                    if k == '8 пм пн':
                                                                                                                                                        bot.send_message(
                                                                                                                                                            chat_id=update.message.chat_id,
                                                                                                                                                            text=" Понеділок\n"
                                                                                                                                                                 " 1 - Укр.мова 49   каб;\n"
                                                                                                                                                                 " 2 - Укр.мова 49 каб;\n"
                                                                                                                                                                 " 3 - Математика 45 каб ;\n"
                                                                                                                                                                 " 4 - Математика 45 каб ;\n"
                                                                                                                                                                 " 5 - Історія 54 каб ;\n"
                                                                                                                                                                 " 6 - Анг.мова 54 каб;\n")

                                                                                                                                                    else:
                                                                                                                                                        if k == '8 пм вт':
                                                                                                                                                            bot.send_message(
                                                                                                                                                                chat_id=update.message.chat_id,
                                                                                                                                                                text=" Вівторок\n"
                                                                                                                                                                     " 1 - Біологія/Матем. 49   каб;\n"
                                                                                                                                                                     " 2 - Біологія/Матем. 49 каб;\n"
                                                                                                                                                                     " 3 - Осн.здор 45 каб ;\n"
                                                                                                                                                                     " 4 - Фіз.культура 45 каб ;\n"
                                                                                                                                                                     " 5 - Математика 54 каб ;\n"
                                                                                                                                                                     " 6 - Математика 54 каб;\n"
                                                                                                                                                                     " 7 - Правознавство 45 каб")
                                                                                                                                                        else:
                                                                                                                                                            if k == '8 пм ср':
                                                                                                                                                                bot.send_message(
                                                                                                                                                                    chat_id=update.message.chat_id,
                                                                                                                                                                    text=" Середа\n"
                                                                                                                                                                         " 1 - Анг.мова 4   каб;\n"
                                                                                                                                                                         " 2 - Анг.мова 4 каб;\n"
                                                                                                                                                                         " 3 - Біологія 32/50 каб ;\n"
                                                                                                                                                                         " 4 - Біологія 32/50 каб ;\n"
                                                                                                                                                                         " 5 - Мистецтво 57 каб ;\n"
                                                                                                                                                                         " 6 - Історія 45 каб;\n"
                                                                                                                                                                         " 7 - Інформатика 51/52 каб\n"
                                                                                                                                                                         " 8 - Інформатика 51/52 каб")
                                                                                                                                                            else:
                                                                                                                                                                if k == '8 пм чт':
                                                                                                                                                                    bot.send_message(
                                                                                                                                                                        chat_id=update.message.chat_id,
                                                                                                                                                                        text=" Четверг\n"
                                                                                                                                                                             " 1 - Матем./Хімія 15/31 каб;\n"
                                                                                                                                                                             " 2 - Матем./Хімія 15/32 каб;\n"
                                                                                                                                                                             " 3 - Хімія/Матем. 31/5  каб ;\n"
                                                                                                                                                                             " 4 - Хімія/Матем. 31/5  каб ;\n"
                                                                                                                                                                             " 5 - Фіз.культура Спорт.зал ;\n"
                                                                                                                                                                             " 6 - Фіз.культура Спорт.зал ;\n"
                                                                                                                                                                             " 7 - Зар.літ 44 каб")
                                                                                                                                                                else:
                                                                                                                                                                    if k == '8 пм пт':
                                                                                                                                                                        bot.send_message(
                                                                                                                                                                            chat_id=update.message.chat_id,
                                                                                                                                                                            text=" П'ятниця\n"
                                                                                                                                                                                 " 1 - Географія 10   каб;\n"
                                                                                                                                                                                 " 2 - Географія 10 каб;\n"
                                                                                                                                                                                 " 3 - Хімія/Матем. 31/5 каб ;\n"
                                                                                                                                                                                 " 4 - Хімія/Матем. 31/5 каб ;\n"
                                                                                                                                                                                 " 5 - Укр.літ 43 каб ;\n"
                                                                                                                                                                                 " 6 - Укр.літ 43 каб;\n"
                                                                                                                                                                                 " 7 - Труд.навч 15 каб")
                                                                                                                                                                    else:
                                                                                                                                                                            if k == '8 філ пн':
                                                                                                                                                                                bot.send_message(
                                                                                                                                                                                    chat_id=update.message.chat_id,
                                                                                                                                                                                    text=" Понеділок\n"
                                                                                                                                                                                         " 1 - Анг.мова 34/50   каб;\n"
                                                                                                                                                                                         " 2 - Анг.мова 34/50 каб;\n"
                                                                                                                                                                                         " 3 - Укр.мова 43/34 каб ;\n"
                                                                                                                                                                                         " 4 - Укр.мова 43/34 каб ;\n"
                                                                                                                                                                                         " 5 - Хімія 5 каб ;\n"
                                                                                                                                                                                         " 6 - Хімія 5 каб;\n"
                                                                                                                                                                                         " 7 - Історія 50 каб")
                                                                                                                                                                            else:
                                                                                                                                                                                if k == '8 філ вт':
                                                                                                                                                                                    bot.send_message(
                                                                                                                                                                                        chat_id=update.message.chat_id,
                                                                                                                                                                                        text=" Вівторок\n"
                                                                                                                                                                                             " 1 - Математика 10   каб;\n"
                                                                                                                                                                                             " 2 - Математика 10 каб;\n"
                                                                                                                                                                                             " 3 - Інформатика 31/5 каб ;\n"
                                                                                                                                                                                             " 4 - Інформатика 31/5 каб ;\n"
                                                                                                                                                                                             " 5 - Труд.навч 43 каб ;\n"
                                                                                                                                                                                             " 6 - Укр.літ 43 каб;\n"
                                                                                                                                                                                             " 7 - Укр.літ 15 каб\n"
                                                                                                                                                                                             " 8 - Мистецтво 57 каб")
                                                                                                                                                                                else:
                                                                                                                                                                                    if k == '8 філ ср':
                                                                                                                                                                                        bot.send_message(
                                                                                                                                                                                            chat_id=update.message.chat_id,
                                                                                                                                                                                            text=" Середа\n"
                                                                                                                                                                                                 " 1 - Фізика 54   каб;\n"
                                                                                                                                                                                                 " 2 - Фізика 54 каб;\n"
                                                                                                                                                                                                 " 3 - Укр.мова 4/43 каб ;\n"
                                                                                                                                                                                                 " 4 - Укр.мова 4/43 каб ;\n"
                                                                                                                                                                                                 " 5 - Фіз.культура 43 каб ;\n"
                                                                                                                                                                                                 " 6 - Фіз.культура 43 каб;\n"
                                                                                                                                                                                                 " 7 - Зар.літ 44 каб\n")

                                                                                                                                                                                    else:
                                                                                                                                                                                        if k == '8 філ чт':
                                                                                                                                                                                            bot.send_message(
                                                                                                                                                                                                chat_id=update.message.chat_id,
                                                                                                                                                                                                text=" Четверг\n"
                                                                                                                                                                                                     " 1 - Географія 10   каб;\n"
                                                                                                                                                                                                     " 2 - Географія 10 каб;\n"
                                                                                                                                                                                                     " 3 - Анг.мова 34/15 каб ;\n"
                                                                                                                                                                                                     " 4 - Анг.мова 34/15 каб ;\n"
                                                                                                                                                                                                     " 5 - Укр.літ 43 каб ;\n"
                                                                                                                                                                                                     " 6 - Укр.літ 43 каб;\n"
                                                                                                                                                                                                     " 7 - Осн.здор 57 каб\n")

                                                                                                                                                                                        else:
                                                                                                                                                                                            if k == '8 філ пт':
                                                                                                                                                                                                bot.send_message(
                                                                                                                                                                                                    chat_id=update.message.chat_id,
                                                                                                                                                                                                    text=" П'ятниця\n"
                                                                                                                                                                                                         " 1 - Математика 12 каб;\n"
                                                                                                                                                                                                         " 2 - Математика 12 каб;\n"
                                                                                                                                                                                                         " 3 - Історія 35 каб ;\n"
                                                                                                                                                                                                         " 4 - Біологія 50 каб ;\n"
                                                                                                                                                                                                         " 5 - Біологія 50 каб ;\n"
                                                                                                                                                                                                         " 6 - Фіз.культура Спорт.зал;\n"
                                                                                                                                                                                                         " 7 - Зар.літ 44 каб\nwsa")
                                                                                                                                                                                            else:
                                                                                                                                                                                                 bot.send_message(chat_id=update.message.chat_id,
                                                                                                                                                                                                               text='Не знайдено розкладу для вписаного вами дня')













# Хендлеры
start_command_handler = CommandHandler('start', startCommand)
help_command_handler = CommandHandler('help', helpCommand)
second_Mathematical_command_handler = CommandHandler('second_Mathematical', second_MathematicalCommand)
second_Philological_command_handler = CommandHandler('second_Philological', second_PhilologicalCommand)
Rozklad_na_tyzden_command_handler = CommandHandler('Rozklad_na_tyzden', Rozklad_na_tyzdenCommand)
third_NM_command_handler = CommandHandler('third_NM', third_NMCommand)
third_Philological_command_handler = CommandHandler('third_Philological', third_PhilologicalCommand)
text_message_handler = MessageHandler(Filters.text, textMessage)
first_Philological_command_handler = CommandHandler('first_Philological',first_PhilologicalCommand)
first_Naturalistic_command_handler = CommandHandler('first_Naturalistic',first_NaturalisticCommand)
first_Mathematical_command_handler = CommandHandler('first_Mathematical',first_MathematicalCommand)
eight_Philological_command_handler = CommandHandler('eight_Philological',eight_PhilologicalCommand)
eight_NM_command_handler= CommandHandler('eight_NM', eight_NMCommand)
# Добавляем хендлеры в диспетчер
dispatcher.add_handler(start_command_handler)
dispatcher.add_handler(help_command_handler)
dispatcher.add_handler(text_message_handler)
dispatcher.add_handler(second_Mathematical_command_handler)
dispatcher.add_handler(second_Philological_command_handler)
dispatcher.add_handler(third_NM_command_handler)
dispatcher.add_handler(Rozklad_na_tyzden_command_handler)
dispatcher.add_handler(third_Philological_command_handler)
dispatcher.add_handler(first_Philological_command_handler)
dispatcher.add_handler(first_Naturalistic_command_handler)
dispatcher.add_handler(first_Mathematical_command_handler)
dispatcher.add_handler(eight_Philological_command_handler)
dispatcher.add_handler(eight_NM_command_handler)
# Начинаем поиск обновлений
updater.start_polling(clean=True)
# Останавливаем бота, если были нажаты Ctrl + C
updater.idle()












































































































































































#Made by Kharysh Bogdan protected from Copyrighting